{"_id":{"$oid":"615f1dccda06b44d991c26f0"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true,"Actors":["Kasi Lemmings"]}
{"_id":{"$oid":"615f3038da06b44d991c26f1"},"Title":"The Conjuring","Description":"The Conjuring is a 2013 supernatural horror film inspired by the true-life story of the Perron family, who claimed they \"lived among the dead\" in the 1970s as spirits both friendly and sinister inhabited their Rhode Island farmhouse.","Genre":{"Name":"Horror","Description":"A horror film is one that seeks to elicit fear or disgust in its audience for entertainment purposes."},"ImagePath":"https://c8.alamy.com/comp/DT9FMB/movie-poster-the-conjuring-2013-DT9FMB.jpg","Director":{"Name":"Michael Chaves","Bio":"Michael Chaves is an American film director, screenwriter, visual effects artist, editor, and executive producer.","Birth":"1989","Death":"Alive"},"Featured":"true"}
{"_id":{"$oid":"615f31cdda06b44d991c26f2"},"Title":"The Addams Family","Description":"Addams Family characters include Gomez, Morticia, Uncle Fester, Lurch, Grandmama, Wednesday and Pugsley. The Addamses are a satirical inversion of the ideal American family; an eccentric, wealthy clan who delight in the macabre and are unaware that people find them bizarre or frightening.","Genre":{"Name":"Dark Comedy","Description":"Dark comedy, also known as black humor, dark humor, morbid humor, edgy humor, or gallows humor, is a style of comedy that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss. "},"Director":{"Name":"Barry Sonnenfeld","Bio":"Barry Sonnenfeld is an American filmmaker and television director.","Birth":"1953","Death":"Alive"},"ImagePath":"https://prodimage.images-bn.com/pimages/0032429329738_p0_v1_s550x406.jpg","Featured":"false"}
{"_id":{"$oid":"615f324fda06b44d991c26f3"},"Title":"Nightmare Before Christmas","Description":"The film follows the misadventures of Jack Skellington, Halloweentown's beloved pumpkin king, who has become bored with the same annual routine of frightening people in the real world. When Jack accidentally stumbles on Christmastown, all bright colors and warm spirits, he gets a new lease on life. He plots to bring Christmas under his control.","Genre":{"Name":"Animation","Description":"Animated Films are ones in which individual drawings, paintings, or illustrations are photographed frame by frame (stop-frame cinematography)."},"Director":{"Name":"Charles Henry Selick","Bio":"Selick is an American stop motion director, producer, and writer. He is best known for the animated films, The Nightmare Before Christmas, James and the Giant Peach, Coraline, and Wendell and Wild.","Birth":"1952","Death":"Alive"},"ImagePath":"https://www.udiscovermusic.com/wp-content/uploads/2018/09/The-Nightmare-Before-Christmas-album-cover-web-optimised-820.jpg","Featured":"false"}
{"_id":{"$oid":"615f3352da06b44d991c26f4"},"Title":"The Heat","Description":"FBI Special Agent Sarah Ashburn (Sandra Bullock) is a methodical investigator with a long-standing reputation for excellence -- and arrogance. In contrast, foul-mouthed, hot-tempered detective Shannon Mullins (Melissa McCarthy) goes with her gut instincts and street smarts to remove criminals from the streets of Boston. Sparks fly when these polar opposites have to work together to capture a drug lord, but in the process, they become the last thing anyone expected -- buddies.","Genre":{"Name":"Comedy","Description":"A comedy film is a category of film in which the main emphasis is on humor."},"Director":{"Name":"Paul Feig","Bio":"Paul Samuel Feig is an American actor and filmmaker.","Birth":"1962","Death":"Alive"},"ImagePath":"https://www.newdvdreleasedates.com/images/posters/large/the-heat-2013-03.jpg","Featured":"false"}
{"_id":{"$oid":"615f33c8da06b44d991c26f5"},"Title":"Jungle Cruise","Description":"Dr. Lily Houghton enlists the aid of wisecracking skipper Frank Wolff to take her down the Amazon in his ramshackle boat. Together, they search for an ancient tree that holds the power to heal -- a discovery that will change the future of medicine.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist or protagonists are thrust into a series of events that typically include violence, extended fighting, physical feats, rescues and frantic chases."},"Director":{"Name":"Jaume Collet-Serra","Bio":"Jaume Collet-Serra is a Spanish-American film director and producer.","Birth":"1974","Death":"Alive"},"ImagePath":"https://m.media-amazon.com/images/I/91cOSkwoAFL._AC_SY679_.jpg","Featured":"false"}
{"_id":{"$oid":"615f3a8ada06b44d991c26f6"},"Title":"Parasite","Description":"Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.","Genre":{"Name":"Dark Comedy","Description":"Dark comedy, also known as black humor, dark humor, morbid humor, edgy humor, or gallows humor, is a style of comedy that makes light of subject matter that is generally considered taboo, particularly subjects that are normally considered serious or painful to discuss. "},"Director":{"Name":"Bong Joon-ho","Bio":"Bong Joon-ho is a South Korean film director, producer and screenwriter.","Birth":"1969","Death":"Alive"},"ImagePath":"https://images.redbox.com/Images/EPC/boxArtVertical/209448.jpg","Featured":"false"}
{"_id":{"$oid":"615f3e47da06b44d991c26f7"},"Title":"The Host","Description":"Careless American military personnel dump chemicals into South Korea's Han River. Several years later, a creature emerges from the tainted waters and sinks its ravenous jaws into local residents. When the creature abducts their daughter (Go Ah-sung), a vendor (Song Kang-ho) and his family decide that they are the only ones who can save her.","Genre":{"Name":"Horror","Descrption":"A horror film is one that seeks to elicit fear or disgust in its audience for entertainment purposes."},"Director":{"Name":"Bong Joon-ho","Bio":"Bong Joon-ho is a South Korean film director, producer and screenwriter.","Birth":"1969","Death":"Alive"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/thumb/5/55/The_Host_film_poster.jpg/220px-The_Host_film_poster.jpg","Featured":"false"}
{"_id":{"$oid":"615f3f79da06b44d991c26f8"},"Title":"Corpse Bride","Descrption":"Victor (Johnny Depp) and Victoria's (Emily Watson) families have arranged their marriage. Though they like each other, Victor is nervous about the ceremony. While he's in a forest practicing his lines for the wedding, a tree branch becomes a hand that drags him to the land of the dead. It belongs to Emily, who was murdered after eloping with her love and wants to marry Victor. Victor must get back aboveground before Victoria marries the villainous Barkis Bittern (Richard E. Grant).","Genre":{"Name":"Musical","Description":"Musical film is a film genre in which songs by the characters are interwoven into the narrative, sometimes accompanied by dancing."},"Director":{"Name":"Tim Burton","Bio":"Timothy Walter Burton is an American film director, producer, writer and artist.","Birth":"1958","Death":"Alive"},"ImagePath":"https://m.media-amazon.com/images/I/61GaauB+WpL._SY550_.jpg","Featured":"false"}
{"_id":{"$oid":"615f4095da06b44d991c26f9"},"Title":"Ghost","Description":"Sam Wheat (Patrick Swayze) is a banker, Molly Jensen (Demi Moore) is an artist, and the two are madly in love. However, when Sam is murdered by friend and corrupt business partner Carl Bruner (Tony Goldwyn) over a shady business deal, he is left to roam the earth as a powerless spirit. When he learns of Carl's betrayal, Sam must seek the help of psychic Oda Mae Brown (Whoopi Goldberg) to set things right and protect Molly from Carl and his goons.","Genre":{"Name":"Romance","Description":"Romance films or romance movies are romantic love stories recorded in visual media for broadcast in theaters and on TV that focus on passion, emotion, and the affectionate romantic involvement of the main characters and the journey that their love takes them through dating, courtship or marriage."},"Director":{"Name":"Jerry Zucker","Bio":"Zucker is an American film producer, director, and writer.","Birth":"1950","Death":"Alive"},"ImagePath":"https://upload.wikimedia.org/wikipedia/en/4/41/Ghost_%281990_movie_poster%29.jpg","Featured":"false"}
{"_id":{"$oid":"615f50d7da06b44d991c2704"},"Title":"Coraline","Description":"While exploring her new home, a girl named Coraline (Dakota Fanning) discovers a secret door, behind which lies an alternate world that closely mirrors her own but, in many ways, is better. She rejoices in her discovery, until Other Mother (Teri Hatcher) and the rest of her parallel family try to keep her there forever. Coraline must use all her resources and bravery to make it back to her own family and life.","Genre":{"Name":"Animation","Description":"Animated Films are ones in which individual drawings, paintings, or illustrations are photographed frame by frame (stop-frame cinematography)."},"Director":{"Name":"Charles Henry Selick","Bio":"Selick is an American stop motion director, producer, and writer. He is best known for the animated films, The Nightmare Before Christmas, James and the Giant Peach, Coraline, and Wendell and Wild.","Birth":"1952","Death":"Alive"},"ImagePath":"https://m.media-amazon.com/images/I/81-h4FsEVqL._SY445_.jpg","Featured":"false"}
